<?php


namespace App\Http\Controllers\Sifaris;


use App\Http\Controllers\Controller;
use Barryvdh\Snappy\Facades\SnappyPdf;
use Illuminate\Http\Request;
use Illuminate\Support\Facades\Auth;
use Illuminate\Support\Facades\Redirect;
use Illuminate\Support\Facades\Schema;
use Illuminate\Support\Facades\Validator;
use Krishnahimself\DateConverter\DateConverter;
use Yajra\DataTables\Facades\DataTables;

abstract class SifarisAbstractController extends Controller
{

    public $view_array= array();
    public $model;
    public $model_class;
    public $rules = [];
    public $messages = [
        'required' => 'यो क्षेत्र आवश्यक छ।',
        'string' => 'यो फिल्ड अक्षर हुनुपर्छ।',
        'max' => 'यो फिल्डले अधिकतम संख्या :max सम्म मात्र लिन्छ।',
        'integer'=>'यो फिल्ड अंकमा हुनुपर्छ',
        'np_integer'=>'यो फिल्ड अंकमा हुनुपर्छ',
        'unique'=>''
    ];

    public $palika_types=['महानगरपालिका','उपमहानगरपालिका','नगरपालिका','गाउँपालिका'];
    public $grand_child_types=['नाति','नातिनी'];
    public $child_types=['छोरा','छोरि'];
    public $abbreviations=['श्री','सुश्री','श्रीमती'];
    public $districts=[
        "ताप्लेजुङ",
        "संखुवासभा",
        "सोलुखुम्बु",
        "ओखलढुङ्गा",
        "खोटाङ",
        "भोजपुर",
        "धनकुटा",
        "तेह्रथुम",
        "पाँचथर",
        "इलाम",
        "झापा",
        "मोरङ",
        "सुनसरी",
        "उदयपुर",
        "सप्तरी",
        "सिरहा",
       "धनुषा",
        "महोत्तरी",
        "सर्लाही",
        "रौतहट",
        "बारा",
        "पर्सा",
        "दोलखा",
        "सिन्धुपाल्चोक",
        "रसुवा",
        "धादिङ",
        "नुवाकोट",
        "काठमाडौँ",
        "भक्तपुर",
        "ललितपुर",
        "काभ्रेपलाञ्चोक",
        "रामेछाप",
        "सिन्धुली",
        "मकवानपुर",
        "चितवन",
        "गोरखा",
        "मनाङ",
        "मुस्ताङ",
        "म्याग्दी",
       "कास्की",
        "लमजुङ",
        "तनहुँ",
        "स्याङजा",
        "पर्वत",
        "बागलुङ",
        "रुकुम (पूर्वी भाग)",
       "रोल्पा",
        "प्यूठान",
        "गुल्मी",
        "अर्घाखाँची",
        "पाल्पा",
        "नवलपरासी(पश्चिम)",
        "रुपन्देही",
        "कपिलवस्तु",
        "दाङ",
        "बाँके",
        "बर्दिया",
       "डोल्पा",
        "मुगु",
        "हुम्ला",
        "जुम्ला",
        "कालिकोट",
        "दैलेख",
        "जाजरकोट",
        "रुकुम (पश्चिम भाग)",
        "सल्यान",
        "सुर्खेत",
        "बाजुरा",
        "बझाङ",
        "दार्चुला",
        "बैतडी",
        "डँडेलधुरा",
        "डोटी",
        "अछाम",
        "कैलाली",
        "कञ्चनपुर",
    ];


    public $palikas=[
        "अग्निसाइर कृष्ण सवरन गाउँपालिका",
        "अजयमेरु गाउँपालिका",
        "अजिरकोट गाउँपालिका",
        "अदानचुली गाउँपालिका",
        "अन्नपूर्ण गाउँपालिका",
        "अन्नपूर्ण गाउँपालिका",
        "अपिहिमाल गाउँपालिका",
        "अमरगढी नगरपालिका",
        "अरुण गाउँपालिका",
        "अर्जुनचौपारी गाउँपालिका",
        "अर्जुनधारा नगरपालिका",
        "अर्नमा गाउँपालिका",
        "आठबिसकोट नगरपालिका",
        "आठबीस नगरपालिका",
        "आठराई गाउँपालिका",
        "आठराई त्रिवेणी गाउँपालिका",
        "आदर्श कोटवाल गाउँपालिका",
        "आदर्श गाउँपालिका",
        "आँधिखोला गाउँपालिका",
        "आँबुखैरेनी गाउँपालिका",
        "आमचोक गाउँपालिका",
        "आरुघाट गाउँपालिका",
        "आलिताल गाउँपालिका",
        "इच्छाकामना गाउँपालिका",
        "इनरुवा नगरपालिका",
        "ईटहरी उपमहानगरपालिका",
        "ईन्द्रसरोवर गाउँपालिका",
        "ईन्द्रावती गाउँपालिका",
        "ईलाम नगरपालिका",
        "ईशनाथ नगरपालिका",
        "ईश्वरपुर नगरपालिका",
        "ईस्मा गाउँपालिका",
        "उत्तरगया गाउँपालिका",
        "उदयपुरगढी गाउँपालिका",
        "उमाकुण्ड गाउँपालिका",
        "उर्लाबारी नगरपालिका",
        "ऋषिङ्ग गाउँपालिका",
        "एकडारा गाउँपालिका",
        "ऐरावती गाउँपालिका",
        "ऐसेलुखर्क गाउँपालिका",
        "ओमसतिया गाउँपालिका",
        "औरही गाउँपालिका",
        "औरही गाउँपालिका",
        "औरही नगरपालिका",
        "ककनी गाउँपालिका",
        "कचनकवल गाउँपालिका",
        "कटहरिया नगरपालिका",
        "कटहरी गाउँपालिका",
        "कटारी नगरपालिका",
        "कनका सुन्दरी गाउँपालिका",
        "कन्काई नगरपालिका",
        "कन्चन गाउँपालिका",
        "कन्चनरुप नगरपालिका",
        "कपिलबस्तु नगरपालिका",
        "कपुरकोट गाउँपालिका",
        "कमल गाउँपालिका",
        "कमलबजार नगरपालिका",
        "कमला नगरपालिका",
        "कमलामाई नगरपालिका",
        "करैयामाई गाउँपालिका",
        "कर्जन्हा नगरपालिका",
        "कलैया उपमहानगरपालिका",
        "कल्याणपुर नगरपालिका",
        "कविलासी नगरपालिका",
        "काइके गाउँपालिका",
        "कागेश्वरी मनहरा नगरपालिका",
        "काठमाण्डौ महानगरपालिका",
        "काठेखोला गाउँपालिका",
        "काँडा गाउँपालिका",
        "कानेपोखरी गाउँपालिका",
        "कालिका गाउँपालिका",
        "कालिका गाउँपालिका",
        "कालिका नगरपालिका",
        "कालिकामाई गाउँपालिका",
        "कालिगण्डकी गाउँपालिका",
        "कालिन्चोक गाउँपालिका",
        "कालिमाटी गाउँपालिका",
        "कालीगण्डकी गाउँपालिका",
        "कावासोती नगरपालिका",
        "किर्तिपुर नगरपालिका",
        "किस्पाङ्ग गाउँपालिका",
        "कुमाख मालिका गाउँपालिका",
        "कुम्मायक गाउँपालिका",
        "कुश्मा नगरपालिका",
        "कुसे गाउँपालिका",
        "कृष्णनगर नगरपालिका",
        "कृष्णपुर नगरपालिका",
        "के.आई.सिं. गाउँपालिका",
        "केदारस्युँ गाउँपालिका",
        "केपिलासगढी गाउँपालिका",
        "केराबारी गाउँपालिका",
        "कैलारी गाउँपालिका",
        "कैलाश गाउँपालिका",
        "कोटहीमाई गाउँपालिका",
        "कोन्ज्योसोम गाउँपालिका",
        "कोल्हवी नगरपालिका",
        "कोशी गाउँपालिका",
        "कोहलपुर नगरपालिका",
        "कौडेना गाउँपालिका",
        "क्ब्होलासोथार गाउँपालिका",
        "क्षिरेश्वरनाथ नगरपालिका",
        "खजुरा गाउँपालिका",
        "खडक नगरपालिका",
        "खत्याड गाउँपालिका",
        "खनियाबास गाउँपालिका",
        "खप्तडछान्ना गाउँपालिका",
        "खाँडाचक्र नगरपालिका",
        "खाँडादेवी गाउँपालिका",
        "खाँदबारी नगरपालिका",
        "खानीखोला गाउँपालिका",
        "खार्पुनाथ गाउँपालिका",
        "खाल्सा छिन्ताङ्ग सहीदभूमि गाउँपालिका",
        "खिजीदेम्बा गाउँपालिका",
        "खुम्बु पासाङल्हामु गाउँपालिका",
        "खैरहनी नगरपालिका",
        "खोटेहाङ गाउँपालिका",
        "गंङ्गा जमुना गाउँपालिका",
        "गजुरी गाउँपालिका",
        "गढवा गाउँपालिका",
        "गढी गाउँपालिका",
        "गढीमाई नगरपालिका",
        "गणेशमान चारनाथ नगरपालिका",
        "गण्डकी गाउँपालिका",
        "गन्यापधुरा गाउँपालिका",
        "गरुडा नगरपालिका",
        "गल्कोट नगरपालिका",
        "गल्छी गाउँपालिका",
        "गल्याङ नगरपालिका",
        "गुजरा नगरपालिका",
        "गुठिचौर गाउँपालिका",
        "गुराँस गाउँपालिका",
        "गुर्भाकोट नगरपालिका",
        "गुलरीया नगरपालिका",
        "गुल्मी दरबार गाउँपालिका",
        "गेरुवा गाउँपालिका",
        "गैडहवा गाउँपालिका",
        "गैडाकोट नगरपालिका",
        "गोकर्णेश्वर नगरपालिका",
        "गोकुलगङ्गा गाउँपालिका",
        "गोडैटा नगरपालिका",
        "गोदावरी नगरपालिका",
        "गोदावरी नगरपालिका",
        "गोरखा नगरपालिका",
        "गोलन्जोर गाउँपालिका",
        "गोलबजार नगरपालिका",
        "गोसाईकुण्ड गाउँपालिका",
        "गौमुखी गाउँपालिका",
        "गौमुल गाउँपालिका",
        "गौर नगरपालिका",
        "गौरादह नगरपालिका",
        "गौरिगञ्ज गाउँपालिका",
        "गौरिशंकर गाउँपालिका",
        "गौरीगंगा नगरपालिका",
        "गौशाला नगरपालिका",
        "ग्रामथान गाउँपालिका",
        "घरपझोङ गाउँपालिका",
        "घिरिङ्ग गाउँपालिका",
        "घोडाघोडी नगरपालिका",
        "घोराही उपमहानगरपालिका",
        "चक्रघट्टा गाउँपालिका",
        "चंखेली गाउँपालिका",
        "चन्दननाथ नगरपालिका",
        "चन्द्रकोट गाउँपालिका",
        "चन्द्रनगर गाउँपालिका",
        "चन्द्रपुर नगरपालिका",
        "चन्द्रागिरी नगरपालिका",
        "चम्पादेवी गाउँपालिका",
        "चाँगुनारायण नगरपालिका",
        "चापाकोट नगरपालिका",
        "चामुण्डा बिन्द्रासैनी नगरपालिका",
        "चामे गाउँपालिका",
        "चिङ्गगाड गाउँपालिका",
        "चिचिला गाउँपालिका",
        "चिशंखुगढी गाउँपालिका",
        "चुमनुब्री गाउँपालिका",
        "चुरे गाउँपालिका",
        "चुलाचुली गाउँपालिका",
        "चैनपुर नगरपालिका",
        "चौकुने गाउँपालिका",
        "चौतारा साँगाचोकगढी नगरपालिका",
        "चौदण्डीगढी नगरपालिका",
        "चौरजहारी नगरपालिका",
        "चौरपाटी गाउँपालिका",
        "चौरीदेउराली गाउँपालिका",
        "चौविसे गाउँपालिका",
        "छत्रकोट गाउँपालिका",
        "छत्रदेव गाउँपालिका",
        "छत्रेश्वरी गाउँपालिका",
        "छथर गाउँपालिका",
        "छथर जोरपाटी गाउँपालिका",
        "छबिस पाथिभरा गाउँपालिका",
        "छायाँनाथ रारा नगरपालिका",
        "छार्का ताङसोङ गाउँपालिका",
        "छिन्नमस्ता गाउँपालिका",
        "छिपहरमाई गाउँपालिका",
        "छेडागाड नगरपालिका",
        "छेडेदह गाउँपालिका",
        "जगदुल्ला गाउँपालिका",
        "जगरनाथपुर गाउँपालिका",
        "जनक नन्दिनी गाउँपालिका",
        "जनकपुर उपमहानगरपालिका",
        "जन्तेढुङ्गा गाउँपालिका",
        "जयपृथ्वी नगरपालिका",
        "जलजला गाउँपालिका",
        "जलेश्वर नगरपालिका",
        "जहदा गाउँपालिका",
        "जानकी गाउँपालिका",
        "जानकी गाउँपालिका",
        "जिराभवानी गाउँपालिका",
        "जिरी नगरपालिका",
        "जीतपुर सिमरा उपमहानगरपालिका",
        "जुगल गाउँपालिका",
        "जुनीचाँदे गाउँपालिका",
        "जैमुनी नगरपालिका",
        "जोरायल गाउँपालिका",
        "जोशीपुर गाउँपालिका",
        "ज्वालामुखी गाउँपालिका",
        "झापा गाउँपालिका",
        "झिमरुक गाउँपालिका",
        "टिकापुर नगरपालिका",
        "टोखा नगरपालिका",
        "ट्याम्के मैयुम गाउँपालिका",
        "ठाकुरबाबा नगरपालिका",
        "ठाँटीकाँध गाउँपालिका",
        "ठुलीभेरी नगरपालिका",
        "ठोरी (सुवर्णपुर) गाउँपालिका",
        "डाक्नेश्वरी नगरपालिका",
        "डीलासैनी गाउँपालिका",
        "डुङ्गेश्वर गाउँपालिका",
        "डुडुवा गाउँपालिका",
        "डोल्पो बुद्ध गाउँपालिका",
        "ढकारी गाउँपालिका",
        "ढोरचौर गाउँपालिका",
        "ढोरपाटन नगरपालिका",
        "तमानखोला गाउँपालिका",
        "ताँजाकोट गाउँपालिका",
        "तातोपानी गाउँपालिका",
        "तादी गाउँपालिका",
        "तानसेन नगरपालिका",
        "ताप्ली गाउँपालिका",
        "तामाकोशी गाउँपालिका",
        "तारकेश्वर गाउँपालिका",
        "तारकेश्वर नगरपालिका",
        "ताराखोला गाउँपालिका",
        "तालकोट गाउँपालिका",
        "तिनाउ गाउँपालिका",
        "तिरहुत गाउँपालिका",
        "तिला गाउँपालिका",
        "तिलागुफा नगरपालिका",
        "तिलाठी कोईलाडी गाउँपालिका",
        "तिलोत्तमा नगरापालिका",
        "तीनपाटन गाउँपालिका",
        "तुम्बेवा गाउँपालिका",
        "तुर्माखाँद गाउँपालिका",
        "तुल्सीपुर उपमहानगरपालिका",
        "तेमाल गाउँपालिका",
        "त्रिपुरासुन्दरी गाउँपालिका",
        "त्रिपुरासुन्दरी गाउँपालिका",
        "त्रिपुरासुन्दरी नगरपालिका",
        "त्रियुगा नगरपालिका",
        "त्रिवेणी गाउँपालिका",
        "त्रिवेणी गाउँपालिका",
        "त्रिवेणी गाउँपालिका",
        "त्रिवेणी नगरपालिका",
        "त्रिवेणी नलगाड नगरपालिका",
        "थबाङ्ग गाउँपालिका",
        "थलारा गाउँपालिका",
        "थाक्रे गाउँपालिका",
        "थासाङ गाउँपालिका",
        "थाहा नगरपालिका",
        "दक्षिणकाली नगरपालिका",
        "दंगीशरण गाउँपालिका",
        "दमक नगरपालिका",
        "दशरथचन्द नगरपालिका",
        "दार्मा गाउँपालिका",
        "दालोमे गाउँपालिका",
        "दिपायल सिलगढी नगरपालिका",
        "दिप्रुङ्ग गाउँपालिका",
        "दुईखोली गाउँपालिका",
        "दुधकोशी गाउँपालिका",
        "दुधकौशिका गाउँपालिका",
        "दुधपोखरी गाउँपालिका",
        "दुधौली नगरपालिका",
        "दुप्चेश्वर गाउँपालिका",
        "दुर्गा भगवती गाउँपालिका",
        "दुर्गाथली गाउँपालिका",
        "दुल्लु नगरपालिका",
        "दुहबी नगरपालिका",
        "दुहुँ गाउँपालिका",
        "देउमाई नगरपालिका",
        "देबदह नगरपालिका",
        "देवघाट गाउँपालिका",
        "देवचुली नगरपालिका",
        "देवताल गाउँपालिका",
        "देवानगन्ज गाउँपालिका",
        "देवाही गोनाही नगरपालिका",
        "दोगडाकेदार गाउँपालिका",
        "दोरम्बा गाउँपालिका",
        "दोर्दी गाउँपालिका",
        "धनकुटा नगरपालिका",
        "धनकौल गाउँपालिका",
        "धनगढी उपमहानगरपालिका",
        "धनगढीमाई नगरपालिका",
        "धनपालथान गाउँपालिका",
        "धनुषाधाम नगरपालिका",
        "धनौजी गाउँपालिका",
        "धरान उपमहानगरपालिका",
        "धर्मदेवी नगरपालिका",
        "धवलागिरी गाउँपालिका",
        "धार्चे गाउँपालिका",
        "धुनीबेंशी नगरपालिका",
        "धुर्कोट गाउँपालिका",
        "धुलिखेल नगरपालिका",
        "धोबीनी गाउँपालिका",
        "ध्याङलेख गाउँपालिका",
        "नगराइन नगरपालिका",
        "नमोबुद्ध नगरपालिका",
        "नरहरिनाथ गाउँपालिका",
        "नरहा गाउँपालिका",
        "नरैनापुर गाउँपालिका",
        "नवदुर्गा गाउँपालिका",
        "नवराजपुर गाउँपालिका",
        "नागार्जुन नगरपालिका",
        "नाम्खा गाउँपालिका",
        "नारफु गाउँपालिका",
        "नारायण नगरपालिका",
        "नाशोङ गाउँपालिका",
        "निजगढ नगरपालिका",
        "निसीखोला गाउँपालिका",
        "निस्दी गाउँपालिका",
        "नीलकण्ठ नगरपालिका",
        "नेचासल्यान गाउँपालिका",
        "नेत्रावती गाउँपालिका",
        "नेपालगञ्ज उपमहानगरपालिका",
        "नेस्याङ गाउँपालिका",
        "नौकुण्ड गाउँपालिका",
        "नौगाड गाउँपालिका",
        "नौबहिनी गाउँपालिका",
        "नौमुले गाउँपालिका",
        "पकाहा मैनपुर गाउँपालिका",
        "पंचदेवल बिनायक नगरपालिका",
        "पचरौता नगरपालिका",
        "पचाल झरना गाउँपालिका",
        "पञ्चपुरी नगरपालिका",
        "पटेर्वा सुगौली गाउँपालिका",
        "पथरी शनिश्चरे नगरपालिका",
        "पनौती नगरपालिका",
        "पन्चकन्या गाउँपालिका",
        "पन्चेश्वर गाउँपालिका",
        "परवानीपुर गाउँपालिका",
        "परशुराम नगरपालिका",
        "परोहा नगरपालिका",
        "पर्सा गाउँपालिका",
        "पर्सागढी नगरपालिका",
        "पलाता गाउँपालिका",
        "पाख्रिबास नगरपालिका",
        "पाँचखपन नगरपालिका",
        "पाँचखाल नगरपालिका",
        "पाँचपोखरी थाड०पाल गाउँपालिका",
        "पाटन नगरपालिका",
        "पाणिनी गाउँपालिका",
        "पाण्डव गुफा गाउँपालिका",
        "पातारासी गाउँपालिका",
        "पार्वतीकुण्ड गाउँपालिका",
        "पालुङ्गटार नगरपालिका",
        "पाल्हीनन्दन गाउँपालिका",
        "पिपरा गाउँपालिका",
        "पुचौंडी नगरपालिका",
        "पुतलीबजार नगरपालिका",
        "पुथा उत्तरगंगा गाउँपालिका",
        "पुनर्वास नगरपालिका",
        "पुर्वखोला गाउँपालिका",
        "पुर्विचौकी गाउँपालिका",
        "पैयुं गाउँपालिका",
        "पोखरा लेखनाथ महानगरपालिका",
        "पोखरिया नगरपालिका",
        "पौवा दुङ्मा गाउँपालिका",
        "प्यूठान नगरपालिका",
        "प्रतापपुर गाउँपालिका",
        "प्रसौनी गाउँपालिका",
        "फक्ताङ्लुङ्ग गाउँपालिका",
        "फतुवा बिजयपुर नगरपालिका",
        "फलेबास नगरपालिका",
        "फाकफोकथुम गाउँपालिका",
        "फालेलुङ्ग गाउँपालिका",
        "फाल्गुनन्द गाउँपालिका",
        "फिक्कल गाउँपालिका",
        "फिदिम नगरपालिका",
        "फुङलिङ्ग नगरपालिका",
        "फेटा गाउँपालिका",
        "फेदाप गाउँपालिका",
        "फेदीखोला गाउँपालिका",
        "बकैया गाउँपालिका",
        "बगनासकाली गाउँपालिका",
        "बंगलाचुली गाउँपालिका",
        "बटेश्वर गाउँपालिका",
        "बडिगाड गाउँपालिका",
        "बडिमालिका नगरपालिका",
        "बडीकेदार गाउँपालिका",
        "बढैयाताल गाउँपालिका",
        "बनगाड कुपिण्डे नगरपालिका",
        "बनेपा नगरपालिका",
        "बन्दिपुर गाउँपालिका",
        "बबई गाउँपालिका",
        "बरहथवा नगरपालिका",
        "बराह नगरपालिका",
        "बराहताल गाउँपालिका",
        "बराहपोखरी गाउँपालिका",
        "बरियारपट्टी गाउँपालिका",
        "बरेङ गाउँपालिका",
        "बर्जु गाउँपालिका",
        "बर्दगोरिया गाउँपालिका",
        "बर्दघाट नगरपालिका",
        "बर्दिबास नगरपालिका",
        "बलरा नगरपालिका",
        "बलवा नगरपालिका",
        "बलान बिहुल गाउँपालिका",
        "बलेफी गाउँपालिका",
        "बसबरिया गाउँपालिका",
        "बहुदरमाई नगरपालिका",
        "बागचौर नगरपालिका",
        "बागमती नगरपालिका",
        "बाग्मती गाउँपालिका",
        "बाग्मती गाउँपालिका",
        "बाग्लुङ्ग नगरपालिका",
        "बाणगंगा नगरपालिका",
        "बान्नीगढी जयगढ गाउँपालिका",
        "बाँफिकोट गाउँपालिका",
        "बारबर्दिया नगरपालिका",
        "बारागढी गाउँपालिका",
        "बारेकोट गाउँपालिका",
        "बाँसगढी नगरपालिका",
        "बाह्रगाउँ मुक्तिक्षेत्र गाउँपालिका",
        "बाह्रदशी गाउँपालिका",
        "बाह्रबिसे नगरपालिका",
        "बिगु गाउँपालिका",
        "बिजयनगर गाउँपालिका",
        "बित्थडचिर गाउँपालिका",
        "बिदुर नगरपालिका",
        "बिदेह नगरपालिका",
        "बिनयी त्रिवेणी गाउँपालिका",
        "बिन्दबासिनी गाउँपालिका",
        "बिरगन्ज महानगरपालिका",
        "बिराटनगर महानगरपालिका",
        "बिरुवा गाउँपालिका",
        "बिर्तामोड नगरपालिका",
        "बिष्णुपुर गाउँपालिका",
        "बिहादी गाउँपालिका",
        "बीरेन्द्रनगर नगरपालिका",
        "बुंगल नगरपालिका",
        "बुङ्दीकाली गाउँपालिका",
        "बुटवल उपमहानगरपालिका",
        "बुढानिलकण्ठ नगरपालिका",
        "बुढीगंगा गाउँपालिका",
        "बुढीगंगा नगरपालिका",
        "बुढीनन्दा नगरपालिका",
        "बुद्धभूमी नगरपालिका",
        "बुद्धशान्ति गाउँपालिका",
        "बुलिङ्गटार गाउँपालिका",
        "बृन्दावन नगरपालिका",
        "बेथानचोक गाउँपालिका",
        "बेदकोट नगरपालिका",
        "बेनी नगरपालिका",
        "बेनीघाट रोराङ्ग गाउँपालिका",
        "बेलका नगरपालिका",
        "बेलकोटगढी नगरपालिका",
        "बेलडाँडी गाउँपालिका",
        "बेलबारी नगरपालिका",
        "बेलौरी नगरपालिका",
        "बेल्ही चपेना गाउँपालिका",
        "बेंसीशहर नगरापालिका",
        "बैजनाथ गाउँपालिका",
        "बैतेधर गाउँपालिका",
        "बोगटान गाउँपालिका",
        "बोदेबरसाईन नगरपालिका",
        "बौधीमाई नगरपालिका",
        "ब्याँस गाउँपालिका",
        "ब्यास नगरपालिका",
        "ब्रह्मपुरी गाउँपालिका",
        "भक्तपुर नगरपालिका",
        "भगवतीमाई गाउँपालिका",
        "भगवानपुर गाउँपालिका",
        "भँगाहा नगरपालिका",
        "भजनी नगरपालिका",
        "भद्रपुर नगरपालिका",
        "भरतपुर महानगरपालिका",
        "भागेश्वर गाउँपालिका",
        "भानु नगरपालिका",
        "भिमदत्त नगरपालिका",
        "भिमफेदी गाउँपालिका",
        "भिमसेन गाउँपालिका",
        "भिमाद नगरपालिका",
        "भिमेश्वर नगरपालिका",
        "भीरकोट नगरपालिका",
        "भुमिकास्थान नगरपालिका",
        "भुम्लु गाउँपालिका",
        "भूमे गाउँपालिका",
        "भेरीगंगा नगरपालिका",
        "भेरीमालिका नगरपालिका",
        "भैरवी गाउँपालिका",
        "भोक्राहा गाउँपालिका",
        "भोजपुर नगरपालिका",
        "भोटखोला गाउँपालिका",
        "भोटेकोशी गाउँपालिका",
        "मकवानपुरगढी गाउँपालिका",
        "मकालु गाउँपालिका",
        "मंगलसेन नगरपालिका",
        "मंगला गाउँपालिका",
        "मटिहानी नगरपालिका",
        "मण्डन देउपुर नगरपालिका",
        "मदाने गाउँपालिका",
        "मधुवन नगरपालिका",
        "मध्यनेपाल नगरपालिका",
        "मध्यपुर थिमी नगरपालिका",
        "मध्यबिन्दु नगरपालिका",
        "मनरा शिसवा नगरपालिका",
        "मनहरी गाउँपालिका",
        "मन्थली नगरपालिका",
        "मरिण गाउँपालिका",
        "मर्चवारी गाउँपालिका",
        "मलंगवा नगरपालिका",
        "मल्लरानी गाउँपालिका",
        "मष्टा गाउँपालिका",
        "मस्र्याङ्गदी गाउँपालिका",
        "महाकाली नगरपालिका",
        "महागढीमाई नगरपालिका",
        "महाङ्काल गाउँपालिका",
        "महादेवा गाउँपालिका",
        "महाबु गाउँपालिका",
        "महाभारत गाउँपालिका",
        "महाराजगन्ज नगरपालिका",
        "महालक्ष्मी नगरपालिका",
        "महालक्ष्मी नगरपालिका",
        "महावै गाउँपालिका",
        "महाशिला गाउँपालिका",
        "महोत्तरी गाउँपालिका",
        "माई जोगमाई गाउँपालिका",
        "माई नगरपालिका",
        "माङसेबुङ गाउँपालिका",
        "माछापुच्छ्र्े गाउँपालिका",
        "माडी गाउँपालिका",
        "माडी नगरपालिका",
        "माण्डवी गाउँपालिका",
        "माथागढी गाउँपालिका",
        "मादी गाउँपालिका",
        "मादी नगरपालिका",
        "माधव नारायण नगरपालिका",
        "मानेभन्ज्याङ्ग गाउँपालिका",
        "मायादेवी गाउँपालिका",
        "मायादेवी गाउँपालिका",
        "मार्मा गाउँपालिका",
        "मालारानी गाउँपालिका",
        "मालिका गाउँपालिका",
        "मालिका गाउँपालिका",
        "मालिकार्जुन गाउँपालिका",
        "माहाकाली नगरपालिका",
        "माहाकुलुङ गाउँपालिका",
        "मिक्लाजुङ गाउँपालिका",
        "मिक्लाजुङ्ग गाउँपालिका",
        "मिक्वाखोला गाउँपालिका",
        "मिथिला नगरपालिका",
        "मिथिला बिहारी नगरपालिका",
        "मिर्चेया नगरपालिका",
        "मुखियापट्टी मुसहरमिया गाउँपालिका",
        "मुगुमकार्मारोग गाउँपालिका",
        "मुड्केचुला गाउँपालिका",
        "मुसिकोट नगरपालिका",
        "मुसिकोट नगरपालिका",
        "मेघाङ्ग गाउँपालिका",
        "मेचीनगर नगरपालिका",
        "मेन्छयायेम गाउँपालिका",
        "मेरिङ्गदेन गाउँपालिका",
        "मेलम्ची नगरपालिका",
        "मेलुङ्ग गाउँपालिका",
        "मेलौली नगरपालिका",
        "मेल्लेख गाउँपालिका",
        "मैवाखोला गाउँपालिका",
        "मोदी गाउँपालिका",
        "मोलुङ्ग गाउँपालिका",
        "मोहन्याल गाउँपालिका",
        "मौलापुर नगरपालिका",
        "म्याग्दे गाउँपालिका",
        "म्याङ्गलुङ्ग नगरपालिका",
        "यमुनामाई गाउँपालिका",
        "यसोधरा गाउँपालिका",
        "याङवरक गाउँपालिका",
        "याङ्वरक गाउँपालिका",
        "रंगेली नगरपालिका",
        "रघुगंगा गाउँपालिका",
        "रतुवामाई नगरपालिका",
        "रत्ननगर नगरपालिका",
        "रम्भा गाउँपालिका",
        "राईनास नगरपालिका",
        "राक्सिराङ्ग गाउँपालिका",
        "राजदेवी नगरपालिका",
        "राजपुर गाउँपालिका",
        "राजपुर नगरपालिका",
        "राजविराज नगरपालिका",
        "राजापुर नगरपालिका",
        "राप्ती गाउँपालिका",
        "राप्ती नगरपालिका",
        "राप्ती सोनारी गाउँपालिका",
        "राम गोपालपुर नगरपालिका",
        "रामग्राम नगरपालिका",
        "रामधुनी नगरपालिका",
        "रामनगर गाउँपालिका",
        "रामपुर नगरपालिका",
        "रामप्रसाद राई गाउँपालिका",
        "रामारोशन गाउँपालिका",
        "रामेछाप नगरपालिका",
        "रास्कोट नगरपालिका",
        "रिब्दीकोट गाउँपालिका",
        "रुन्टीगढी गाउँपालिका",
        "रुपनी गाउँपालिका",
        "रुपाकोट मझुवागढी नगरपालिका",
        "रुबी भ्याली गाउँपालिका",
        "रूपा गाउँपालिका",
        "रूरू गाउँपालिका",
        "रेसुङ्गा नगरपालिका",
        "रैनादेवी छहरा गाउँपालिका",
        "रोङ गाउँपालिका",
        "रोल्पा नगरपालिका",
        "रोशी गाउँपालिका",
        "रोहिणी गाउँपालिका",
        "रौतामाई गाउँपालिका",
        "लक्ष्मीनिया गाउँपालिका",
        "लक्ष्मीपुर पतारी गाउँपालिका",
        "लमही नगरपालिका",
        "लम्कि चुहा नगरपालिका",
        "ललितपुर महानगरपालिका",
        "लहान नगरपालिका",
        "लामिडाँडा गाउँपालिका",
        "लालझाडी गाउँपालिका",
        "लालबन्दी नगरपालिका",
        "लालीगुराँस नगरपालिका",
        "लिखु गाउँपालिका",
        "लिखु गाउँपालिका",
        "लिखु गाउँपालिका",
        "लिखु पिके गाउँपालिका",
        "लिसंखु पाखर गाउँपालिका",
        "लुङ्ग्री गाउँपालिका",
        "लुम्बिनी साँस्कृतिक नगरपालिका",
        "लेकबेशी नगरपालिका",
        "लेकम गाउँपालिका",
        "लेटाङ नगरपालिका",
        "लोमन्थाङ गाउँपालिका",
        "लोहरपट्टी नगरपालिका",
        "वालिङ्ग नगरपालिका",
        "विश्रामपुर गाउँपालिका",
        "विष्णु गाउँपालिका",
        "विष्णुपुर गाउँपालिका",
        "शंङ्खरापुर नगरपालिका",
        "शम्भुनाथ नगरपालिका",
        "शहीद लखन गाउँपालिका",
        "शहीदनगर नगरपालिका",
        "शान्तिनगर गाउँपालिका",
        "शारदा नगरपालिका",
        "शिखर नगरपालिका",
        "शितगंगा नगरपालिका",
        "शिवनाथ गाउँपालिका",
        "शिवपुरी गाउँपालिका",
        "शिवराज नगरपालिका",
        "शिवसताक्षी नगरपालिका",
        "शिवालय गाउँपालिका",
        "शुक्लागण्डकी नगरपालिका",
        "शुक्लाफाँटा नगरपालिका",
        "शुद्धोधन गाउँपालिका",
        "शे फोक्सुण्डो गाउँपालिका",
        "शैलुड० गाउँपालिका",
        "शैल्यशिखर नगरपालिका",
        "षडानन्द नगरपालिका",
        "सखुवा प्रसौनी गाउँपालिका",
        "सखुवानान्कारकट्टी गाउँपालिका",
        "सत्यवती गाउँपालिका",
        "सन्दकपुर गाउँपालिका",
        "सन्धिखर्क नगरपालिका",
        "सप्तकोशी नगरपालिका",
        "सबैला नगरपालिका",
        "सभापोखरी गाउँपालिका",
        "सम्मरीमाई गाउँपालिका",
        "सरावल गाउँपालिका",
        "सरुमारानी गाउँपालिका",
        "सर्केगाड गाउँपालिका",
        "साकेला गाउँपालिका",
        "साँगुरीगढी गाउँपालिका",
        "सानीभेरी गाउँपालिका",
        "सान्नी त्रिवेणी गाउँपालिका",
        "साँफेबगर नगरपालिका",
        "साम्सी गाउँपालिका",
        "सायल गाउँपालिका",
        "साल्पासिलिछो गाउँपालिका",
        "सिगास गाउँपालिका",
        "सिंजा गाउँपालिका",
        "सिदिङ्गवा गाउँपालिका",
        "सिद्धलेक गाउँपालिका",
        "सिद्धार्थनगर नगरपालिका",
        "सिद्धिचरण नगरपालिका",
        "सिमकोट गाउँपालिका",
        "सिम्ता गाउँपालिका",
        "सिम्रौनगढ नगरपालिका",
        "सियारी गाउँपालिका",
        "सिरानचोक गाउँपालिका",
        "सिराहा नगरपालिका",
        "सिरीजङ्गा गाउंपालिका",
        "सिलीचोङ गाउँपालिका",
        "सिस्ने गाउँपालिका",
        "सुकिदह गाउँपालिका",
        "सुखीपुर नगरपालिका",
        "सुद्धोधन गाउँपालिका",
        "सुनकोशी गाउँपालिका",
        "सुनकोशी गाउँपालिका",
        "सुनकोशी गाउँपालिका",
        "सुनकोशी गाउँपालिका",
        "सुनछहरी गाउँपालिका",
        "सुनवर्षी नगरपालिका",
        "सुनवल नगरपालिका",
        "सुनापती गाउँपालिका",
        "सुन्दरबजार नगरपालिका",
        "सुन्दरहरैंचा नगरपालिका",
        "सुरुङ्गा नगरपालिका",
        "सुर्नया गाउँपालिका",
        "सुर्यगढी गाउँपालिका",
        "सुलीकोट गाउँपालिका",
        "सुवर्ण गाउँपालिका",
        "सुवर्णावती गाउँपालिका",
        "सुस्ता गाउँपालिका",
        "सूर्मा गाउँपालिका",
        "सूर्यविनायक नगरपालिका",
        "सूर्योदय नगरपालिका",
        "सैनामैना नगरपालिका",
        "सोताङ गाउँपालिका",
        "सोनमा गाउँपालिका",
        "सोरु गाउँपालिका",
        "सोलुदुधकुण्ड नगरपालिका",
        "स्वर्गद्धारी नगरपालिका",
        "स्वामी कार्तिक गाउँपालिका",
        "हतुवागढी गाउँपालिका",
        "हनुमाननगर कङ्कालिनी नगरपालिका",
        "हरिनगरा गाउँपालिका",
        "हरिनास गाउँपालिका",
        "हरिपुर नगरपालिका",
        "हरिपुर्वा नगरपालिका",
        "हरिवन नगरपालिका",
        "हरिहरपुरगढी गाउँपालिका",
        "हलेसी तुवाचुङ नगरपालिका",
        "हल्दीबारी गाउँपालिका",
        "हंसपुर नगरपालिका",
        "हिमा गाउँपालिका",
        "हिमाली गाउँपालिका",
        "हिलिहाङ्ग गाउँपालिका",
        "हुप्सेकोट गाउँपालिका",
        "हेटौडा उपमहानगरपालिका",
        "हेलम्बु गाउँपालिका",
    ];


    public $palika_top_detail_view=[
        'div-class-name'=>'margin-top3 text-red',
        'flex-div'=>array(
            'position'=>'center',
            'rows'=>array(
                [
                    'fields'=>array(
                        ['field_type'=>'span','class'=>'text_bold font-size','content'=>'','dynamic_content'=>'palika_name'],
                        ['field_type'=>'span','class'=>'text_bold font-size','content'=>'','dynamic_content'=>'palika_type'],
                    )
                ],
                [
                    'fields'=>array(
                        ['field_type'=>'span','class'=>'text_bold font-size','content'=>'','dynamic_content'=>'palika_ward_no'],
                        ['field_type'=>'span','class'=>'text_bold font-size','content'=>' नं वडा कार्यालय'],

                    )
                ],
                [
                    'fields'=>array(
                        ['field_type'=>'span','class'=>'text_bold font-size','content'=>'','dynamic_content'=>'word_address'],
                        ['field_type'=>'span','class'=>'text_bold font-size','content'=>'','dynamic_content'=>'district'],

                    )
                ],
                [
                    'fields'=>array(
                        ['field_type'=>'span','class'=>'text_bold font-size','content'=>'','dynamic_content'=>'palika_pradesh'],
                        ['field_type'=>'span','class'=>'text_bold font-size','content'=>', नेपाल'],

                    )
                ]

            )
        )
    ];


    public function __construct()
    {
    }


    public function index(Request $request)
    {
        $data = $this->model_class::where('deleted','=','0')->get();
        if($request->ajax()) {
            if (!empty($request->nibedak_name)) {
                $data = $this->model_class::where('deleted','=','0')
                    ->where('applicant_name_bibaran', 'LIKE', '%'.$request->nibedak_name.'%')
                    ->get();
            }
            if (!empty($request->citizenship_no)) {
                $data = $this->model_class::where('deleted','=','0')->
                where('applicant_citizenship_number', 'LIKE', '%'.$request->citizenship_no.'%')->get();
            }
            if(!empty($request->sifaris_no)){
                $data=$this->model_class::where('deleted','=','0')
                    ->where('id','=',$request->sifaris_no)->get();
            }


            return Datatables::of($data)
                ->addIndexColumn()

                ->addColumn('actions', function($row){
                    return '<div class="text-center">
                    <a href="'.route($this->getViewArray()["show_page_url"],$row['id']).'" class="btn btn-sm btn-primary" data-id="'.$row['id'].'" id="show" data-target="#myModal"><i class="fa fa-eye"></i></a>
                    <a href="'.route($this->getViewArray()["form_edit_url"],$row['id']).'" class="btn btn-sm btn-primary" data-id="'.$row['id'].'" id="edit" data-target="#myModal"><i class="fa fa-pencil"></i></a>
                    <a class="btn btn-sm btn-danger delete-nibedan" data-id="'.$row['id'].'" id="deleteDarta"><i class="fa fa-trash"></i></a>
                    </div>';
                })
                ->rawColumns(['actions','files'])
                ->make(true);
        }


        $data['date'] = DateConverter::fromEnglishDate(date('Y'), date('m'), date('d'))->toNepaliDate();
        return view('sifaris.pages.index_page', ['data'=>$data,'view_array'=>$this->getViewArray()]);
    }


    /**
     * Show the form for creating a new resource.
     *
     * @return \Illuminate\Http\Response
     */
    public function create()
    {
        return view('sifaris.pages.create_page',['view_array'=>$this->view_array]);
    }

    /**
     * Store a newly created resource in storage.
     *
     * @param  \Illuminate\Http\Request  $request
     * @return \Illuminate\Http\Response
     */
    public function store(Request $request)
    {
//        dd($request);
        $validator = Validator::make(
            $request->all(),
            $this->rules,
            $this->messages
        );
        if ($validator->fails()) {
            return redirect()->back()
                ->withErrors($validator)
                ->withInput();
        }
//        $nepaliNagariktaSifaris=new NepaliNagariktaSifaris();
        $this->model=$this->set_values_in_fields($request,$this->model,$this->view_array);
        $this->model->submitted_by=Auth::id();
        if($this->model->save())
        {
            return Redirect::route($this->view_array['show_page_url'],$this->model->id)->with('success','सफलतापूर्वक स्टोर गरियो');
        }
    }

    /**
     * Display the specified resource.
     *
     * @param  int  $id
     * @return \Illuminate\Http\Response
     */
    public function show($id)
    {
        $this->model=$this->model->where('id','=',$id)->get()->first();
        return view('sifaris.pages.main_show_page',['model'=>$this->model,'view_array'=>$this->view_array]);
    }


    public function show_default($id)
    {

        $this->model=$this->model->where('id','=',$id)->get()->first();
        return view('sifaris.pages.show_page',['model'=>$this->model,'view_array'=>$this->view_array,'view_only'=>true]);
    }


    function show_pdf($id)
    {
        $this->model=$this->model->where('id','=',$id)->get()->first();
        //return view('pages.show_page',['model'=>$NagariktaPramanPatra,'view_array'=>$this->view_array]);
        $pdf = SnappyPdf::loadView('sifaris.pages.show_page',['model'=>$this->model,'view_array'=>$this->view_array]);
        $pdf->setOption('enable-javascript', true);
        $pdf->setOption('javascript-delay', 2000);
        $pdf->setOption('enable-smart-shrinking', true);
        $pdf->setOption('no-stop-slow-scripts', true);
        //$pdf->setOption('viewport-size', '400x200');
        //$pdf->setOption('no-outline', true);
        $pdf->setOption('page-size','A4');
        $pdf->setOption('margin-left','0mm');
        $pdf->setOption('margin-right','0mm');
        $pdf->setOption('margin-top','0mm');
        $pdf->setOption('margin-bottom','0mm');
        $pdf->setOption('orientation', 'Portrait');
        //$pdf->setOption('page-height','100');
        //$pdf->setOption('page-width','106.5');
        return $pdf->stream();
    }

    /**
     * Show the form for editing the specified resource.
     *
     * @param  int  $id
     * @return \Illuminate\Http\Response
     */
    public function edit($id)
    {
        $this->model=$this->model->where('id','=',$id)->get()->first();
        return view('sifaris.pages.edit_page',['model'=>$this->model,'view_array'=>$this->view_array]);
    }

    /**
     * Update the specified resource in storage.
     *
     * @param  \Illuminate\Http\Request  $request
     * @param  int  $id
     * @return \Illuminate\Http\Response
     */
    public function update(Request $request, $id)
    {
        $validator = Validator::make(
            $request->all(),
            $this->rules,
            $this->messages
        );
        if ($validator->fails()) {
            return redirect()->back()
                ->withErrors($validator)
                ->withInput();
        }
        $this->model=$this->model->where('id','=',$id)->get()->first();
        $this->model=$this->set_values_in_fields($request,$this->model,$this->view_array);

        if($this->model->save())
        {

            return Redirect::route($this->view_array['show_page_url'],$this->model->id)->with('success','सफलतापूर्वक स्टोर गरियो');
        }
    }

    /**
     * Remove the specified resource from storage.
     *
     * @param  int  $id
     * @return \Illuminate\Http\Response
     */
    public function destroy($id)
    {
        return ($this->model->where('id','=',$id)->update(['deleted'=>1])) ?
            response()->json(
                [
                    'status' => 200,
                    'message' => 'डाटा मेटाइएको छ'
                ]
            ) : response()->json(
                [
                    'status' => 400,
                    'message' => 'Something went wrong'
                ]
            );
    }



































    /**
     * @return array
     */
    public function getViewArray()
    {
        return $this->view_array;
    }

    /**
     * @param array $view_array
     */
    public function setViewArray($view_array)
    {
        $this->view_array = $view_array;
    }


    function set_values_in_fields($request,$model,$view_array)
    {

        $table_fields=Schema::getColumnListing($model->getTable());
        foreach ($table_fields as $table_field)
        {
            foreach ($view_array['form_sections'] as $form_section)
            {
                if(array_key_exists('cols',$form_section['flex-div']))
                {

                    foreach($form_section['flex-div']['cols'] as $col)
                    {
                        foreach ($col['rows'] as $row)
                        {
                            foreach ($row['fields'] as $field)
                            {
                                if($field['field_type']=='input' || $field['field_type']=='select' || $field['field_type']=='date'){
                                    if($table_field==$field['name'])
                                    {
                                        $model->$table_field=$request->$table_field;
                                    }
                                }
                            }
                        }
                    }


                }
                else
                {
                    foreach ($form_section['flex-div']['rows'] as $row)
                    {
                        foreach ($row['fields'] as $field)
                        {
                            if($field['field_type']=='input' || $field['field_type']=='select'|| $field['field_type']=='date'){
                                if($table_field==$field['name'])
                                {
                                    $model->$table_field=$request->$table_field;
                                }
                            }
                        }
                    }
                }
            }
        }
        return $model;
    }
    
    
    
    public function set_values_in_validation($view_array)
    {
        $rules = [];
        foreach ($view_array['form_sections'] as $form_section)
        {
            if(!array_key_exists('cols',$form_section['flex-div']))
            {
                foreach ($form_section['flex-div']['rows'] as $row)
                {
                    foreach ($row['fields'] as $field)
                    {
                        if($field['field_type']=='input' || $field['field_type']=='select'|| $field['field_type']=='textarea'){
                            $rules[$field['name']]=$field['validation'];
                        }
                    }
                }
            }
            else{
                foreach ($form_section['flex-div']['cols'] as $col)
                {
                    foreach ($col['rows'] as $row)
                    {
                        foreach ($row['fields'] as $field)
                        {
                            if($field['field_type']=='input' || $field['field_type']=='select'|| $field['field_type']=='textarea'){
                                $rules[$field['name']]=$field['validation'];
                            }
                        }
                    }
                }
            }

        }
        return $rules;
    }


    public function check_validation()
    {

    }
}